# ðŸ§® Aggregation & Grouping in Pandas

Grouping and aggregating helps you summarize your data â€” for example:

* **â€œWhatâ€™s the average salary per department?â€**
* **â€œHow many users joined the Gym per month?â€**

---

## ðŸ”¹ The `.groupby()` Function

`.groupby()` groups rows of a DataFrame by values in one or more columns so you can apply aggregation functions like `.sum()`, `.mean()`, `.count()`, etc.

### ðŸ“¦ Sample Data

```python
import pandas as pd

df = pd.DataFrame({
    "Department": ["HR", "HR", "IT", "IT", "Marketing", "Marketing", "Sales", "Sales"],
    "Team": ["A", "A", "B", "B", "C", "C", "D", "D"],
    "Gender": ["M", "F", "M", "F", "M", "F", "M", "F"],
    "Salary": [85, 90, 78, 85, 92, 88, 75, 80],
    "Age": [23, 25, 30, 22, 28, 26, 21, 27],
    "JoinDate": pd.to_datetime([
        "2020-01-10", "2020-02-15", "2021-03-20", "2021-04-10",
        "2020-05-30", "2020-06-25", "2021-07-15", "2021-08-01"
    ])
})

df
```

---

## ðŸ§  Basic Grouping Example

```python
df.groupby("Department")["Salary"].mean()
```

> âž• **Group by Department, then calculate average Salary.**

---

## ðŸ” Common Aggregation Functions

```python
df.groupby("Team")["Salary"].mean()     # Average salary per team
df.groupby("Team")["Salary"].sum()      # Total salary per team
df.groupby("Team")["Salary"].count()    # Number of entries per team
df.groupby("Team")["Salary"].min()      # Minimum salary per team
df.groupby("Team")["Salary"].max()      # Maximum salary per team
```

---

## ðŸ”— Grouping by Multiple Columns

```python
df.groupby(["Team", "Gender"])["Salary"].mean()
```

---

## ðŸ› ï¸ Custom Aggregations with `.agg()`

Apply multiple functions at once:

```python
df.groupby("Team")["Salary"].agg(["mean", "max", "min"])
```

Name your own metrics:

```python
df.groupby("Team")["Salary"].agg(
    avg_score="mean",
    high_score="max"
)
```

Different functions for different columns:

```python
df.groupby("Team").agg({
    "Salary": "mean",
    "Age": "max"
})
```

---

## ðŸ”„ `.transform()` vs `.aggregate()` vs `.filter()`

| Operation      | Returns                | Use Case                            |
| -------------- | ---------------------- | ----------------------------------- |
| `.aggregate()` | One value per group    | Summary stats (e.g., mean)          |
| `.transform()` | Same shape as original | Add derived values to original rows |
| `.filter()`    | Subset of rows         | Keep/discard whole groups           |

---

### ðŸ§ª `.transform()` Example

Add average salary per team to each row:

```python
df["Team Avg"] = df.groupby("Team")["Salary"].transform("mean")
df
```

---

### ðŸ” `.filter()` Example

Keep only teams with average salary > 80:

```python
df.groupby("Team").filter(lambda x: x["Salary"].mean() > 80)
```

---

## âœ… Summary

* **`.groupby()`** simplifies data summarization by categories.
* Use **`.mean()`, `.sum()`, `.count()`, `.agg()`** for flexible metrics.
* **`.transform()`** helps attach group info to individual rows.
* **`.filter()`** selectively retains groups based on conditions.

In [3]:
import pandas as pd

In [4]:
df = pd.DataFrame({
    "Department": ["HR", "HR", "IT", "IT", "Marketing", "Marketing", "Sales", "Sales"],
    "Team": ["A", "A", "B", "B", "C", "C", "D", "D"],
    "Gender": ["M", "F", "M", "F", "M", "F", "M", "F"],
    "Salary": [85, 90, 78, 85, 92, 88, 75, 80],
    "Age": [23, 25, 30, 22, 28, 26, 21, 27],
    "JoinDate": pd.to_datetime([
        "2020-01-10", "2020-02-15", "2021-03-20", "2021-04-10",
        "2020-05-30", "2020-06-25", "2021-07-15", "2021-08-01"
    ])
})

In [5]:
df

  Department Team Gender  Salary  Age   JoinDate
0         HR    A      M      85   23 2020-01-10
1         HR    A      F      90   25 2020-02-15
2         IT    B      M      78   30 2021-03-20
3         IT    B      F      85   22 2021-04-10
4  Marketing    C      M      92   28 2020-05-30
5  Marketing    C      F      88   26 2020-06-25
6      Sales    D      M      75   21 2021-07-15
7      Sales    D      F      80   27 2021-08-01

In [6]:
df.groupby("Department")["Salary"].mean()

Department
HR           87.5
IT           81.5
Marketing    90.0
Sales        77.5
Name: Salary, dtype: float64

In [7]:
df.groupby("Department")["Age"].mean()

Department
HR           24.0
IT           26.0
Marketing    27.0
Sales        24.0
Name: Age, dtype: float64

In [8]:
type(df.groupby("Department")["Salary"].mean())

pandas.core.series.Series

In [9]:
df.groupby("Team")["Salary"].sum()

Team
A    175
B    163
C    180
D    155
Name: Salary, dtype: int64

In [10]:
df.groupby("Team")["Salary"].count()

Team
A    2
B    2
C    2
D    2
Name: Salary, dtype: int64

In [11]:
df.groupby("Team")["Salary"].min()

Team
A    85
B    78
C    88
D    75
Name: Salary, dtype: int64

In [12]:
df.groupby("Team")["Salary"].max()

Team
A    90
B    85
C    92
D    80
Name: Salary, dtype: int64

In [13]:
df.groupby("Department")["Salary"].max()

Department
HR           90
IT           85
Marketing    92
Sales        80
Name: Salary, dtype: int64

In [14]:
df.groupby("Team")["Salary"].agg(["mean", "max", "min"])

      mean  max  min
Team
A     87.5   90   85
B     81.5   85   78
C     90.0   92   88
D     77.5   80   75

In [15]:
type(df.groupby("Team")["Salary"].agg(["mean", "max", "min"]))

pandas.core.frame.DataFrame

In [16]:
df.groupby("Team")["Salary"].agg(
    Average_Salary = "mean",
    Max_Salary = "max",
    Min_Salary = "min"
)

      Average_Salary  Max_Salary  Min_Salary
Team
A               87.5          90          85
B               81.5          85          78
C               90.0          92          88
D               77.5          80          75

In [17]:
df.groupby("Team")["Salary"].aggregate(
    Average_Salary = "mean",
    Max_Salary = "max",
    Min_Salary = "min"
)

      Average_Salary  Max_Salary  Min_Salary
Team
A               87.5          90          85
B               81.5          85          78
C               90.0          92          88
D               77.5          80          75

In [18]:
df["Team Avg"] = df.groupby("Team")["Salary"].transform("mean")

## Calculate average salary and then puts it in a new column named 'Team Avg'

In [20]:
df

  Department Team Gender  Salary  Age   JoinDate  Team Avg
0         HR    A      M      85   23 2020-01-10      87.5
1         HR    A      F      90   25 2020-02-15      87.5
2         IT    B      M      78   30 2021-03-20      81.5
3         IT    B      F      85   22 2021-04-10      81.5
4  Marketing    C      M      92   28 2020-05-30      90.0
5  Marketing    C      F      88   26 2020-06-25      90.0
6      Sales    D      M      75   21 2021-07-15      77.5
7      Sales    D      F      80   27 2021-08-01      77.5

In [21]:
df.groupby("Team").filter(lambda x: x["Salary"].mean() > 85)

  Department Team Gender  Salary  Age   JoinDate  Team Avg
0         HR    A      M      85   23 2020-01-10      87.5
1         HR    A      F      90   25 2020-02-15      87.5
4  Marketing    C      M      92   28 2020-05-30      90.0
5  Marketing    C      F      88   26 2020-06-25      90.0